TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                        Unix v18.12.2.LTS *
       3                    ;* Date/Time created: Sun Jun 23 14:38:59 2019                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net/wifi/
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v18.12.2.LTS Copyright (c) 1
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net/w
      13                            .global SlNetIfConfigWifi

    7179                            .dwattr $C$DW$662, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/net/slnetso
    7180                            .dwattr $C$DW$662, DW_AT_decl_line(0x135)
    7181                            .dwattr $C$DW$662, DW_AT_decl_column(0x05)
    7182                    
    7183                    $C$DW$663       .dwtag  DW_TAG_enumerator
    7184                            .dwattr $C$DW$663, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MED")
    7185                            .dwattr $C$DW$663, DW_AT_const_value(0x04)
    7186                            .dwattr $C$DW$663, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/net/slnetso
    7187                            .dwattr $C$DW$663, DW_AT_decl_line(0x136)
    7188                            .dwattr $C$DW$663, DW_AT_decl_column(0x05)
    7189                    
    7190                    $C$DW$664       .dwtag  DW_TAG_enumerator
    7191                            .dwattr $C$DW$664, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_HIGH")
    7192                            .dwattr $C$DW$664, DW_AT_const_value(0x05)
    7193                            .dwattr $C$DW$664, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/net/slnetso
    7194                            .dwattr $C$DW$664, DW_AT_decl_line(0x137)
    7195                            .dwattr $C$DW$664, DW_AT_decl_column(0x05)
    7196                    
    7197                    $C$DW$665       .dwtag  DW_TAG_enumerator
    7198                            .dwattr $C$DW$665, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MAX")
    7199                            .dwattr $C$DW$665, DW_AT_const_value(0x06)
    7200                            .dwattr $C$DW$665, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/net/slnetso
    7201                            .dwattr $C$DW$665, DW_AT_decl_line(0x138)
    7202                            .dwattr $C$DW$665, DW_AT_decl_column(0x05)
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  132

    7203                    
    7204                            .dwattr $C$DW$T$557, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/net/slnet
    7205                            .dwattr $C$DW$T$557, DW_AT_decl_line(0x132)
    7206                            .dwattr $C$DW$T$557, DW_AT_decl_column(0x01)
    7207                            .dwendtag $C$DW$T$557
    7208                    
    7209                    $C$DW$T$558     .dwtag  DW_TAG_typedef
    7210                            .dwattr $C$DW$T$558, DW_AT_name("SlNetSockTxInhibitThreshold_e")
    7211                            .dwattr $C$DW$T$558, DW_AT_type(*$C$DW$T$557)
    7212                            .dwattr $C$DW$T$558, DW_AT_language(DW_LANG_C)
    7213                            .dwattr $C$DW$T$558, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/net/slnet
    7214                            .dwattr $C$DW$T$558, DW_AT_decl_line(0x139)
    7215                            .dwattr $C$DW$T$558, DW_AT_decl_column(0x03)
    7216                    
    7217                    
    7218                    $C$DW$T$559     .dwtag  DW_TAG_enumeration_type
    7219                            .dwattr $C$DW$T$559, DW_AT_byte_size(0x01)
    7220                    $C$DW$666       .dwtag  DW_TAG_enumerator
    7221                            .dwattr $C$DW$666, DW_AT_name("SLNETIF_STATE_DISABLE")
    7222                            .dwattr $C$DW$666, DW_AT_const_value(0x00)
    7223                            .dwattr $C$DW$666, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/net/slnetif
    7224                            .dwattr $C$DW$666, DW_AT_decl_line(0x62)
    7225                            .dwattr $C$DW$666, DW_AT_decl_column(0x05)
    7226                    
    7227                    $C$DW$667       .dwtag  DW_TAG_enumerator
    7228                            .dwattr $C$DW$667, DW_AT_name("SLNETIF_STATE_ENABLE")
    7229                            .dwattr $C$DW$667, DW_AT_const_value(0x01)
    7230                            .dwattr $C$DW$667, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/net/slnetif
    7231                            .dwattr $C$DW$667, DW_AT_decl_line(0x63)
    7232                            .dwattr $C$DW$667, DW_AT_decl_column(0x05)
    7233                    
    7234                            .dwattr $C$DW$T$559, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/net/slnet
    7235                            .dwattr $C$DW$T$559, DW_AT_decl_line(0x61)
    7236                            .dwattr $C$DW$T$559, DW_AT_decl_column(0x01)
    7237                            .dwendtag $C$DW$T$559
    7238                    
    7239                    $C$DW$T$560     .dwtag  DW_TAG_typedef
    7240                            .dwattr $C$DW$T$560, DW_AT_name("SlNetIfState_e")
    7241                            .dwattr $C$DW$T$560, DW_AT_type(*$C$DW$T$559)
    7242                            .dwattr $C$DW$T$560, DW_AT_language(DW_LANG_C)
    7243                            .dwattr $C$DW$T$560, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/net/slnet
    7244                            .dwattr $C$DW$T$560, DW_AT_decl_line(0x64)
    7245                            .dwattr $C$DW$T$560, DW_AT_decl_column(0x03)
    7246                    
    7247                    
    7248                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7249                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x28)
    7250                    $C$DW$668       .dwtag  DW_TAG_member
    7251                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$6)
    7252                            .dwattr $C$DW$668, DW_AT_name("SsidLen")
    7253                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("SsidLen")
    7254                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7255                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    7256                            .dwattr $C$DW$668, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7257                            .dwattr $C$DW$668, DW_AT_decl_line(0x238)
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  133

    7258                            .dwattr $C$DW$668, DW_AT_decl_column(0x0d)
    7259                    
    7260                    $C$DW$669       .dwtag  DW_TAG_member
    7261                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$23)
    7262                            .dwattr $C$DW$669, DW_AT_name("SsidName")
    7263                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("SsidName")
    7264                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7265                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    7266                            .dwattr $C$DW$669, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7267                            .dwattr $C$DW$669, DW_AT_decl_line(0x239)
    7268                            .dwattr $C$DW$669, DW_AT_decl_column(0x0d)
    7269                    
    7270                    $C$DW$670       .dwtag  DW_TAG_member
    7271                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$24)
    7272                            .dwattr $C$DW$670, DW_AT_name("Bssid")
    7273                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("Bssid")
    7274                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7275                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    7276                            .dwattr $C$DW$670, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7277                            .dwattr $C$DW$670, DW_AT_decl_line(0x23a)
    7278                            .dwattr $C$DW$670, DW_AT_decl_column(0x0d)
    7279                    
    7280                    $C$DW$671       .dwtag  DW_TAG_member
    7281                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$6)
    7282                            .dwattr $C$DW$671, DW_AT_name("Padding")
    7283                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("Padding")
    7284                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    7285                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    7286                            .dwattr $C$DW$671, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7287                            .dwattr $C$DW$671, DW_AT_decl_line(0x23b)
    7288                            .dwattr $C$DW$671, DW_AT_decl_column(0x0d)
    7289                    
    7290                            .dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7291                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x237)
    7292                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    7293                            .dwendtag $C$DW$T$25
    7294                    
    7295                    $C$DW$T$235     .dwtag  DW_TAG_typedef
    7296                            .dwattr $C$DW$T$235, DW_AT_name("SlWlanEventConnect_t")
    7297                            .dwattr $C$DW$T$235, DW_AT_type(*$C$DW$T$25)
    7298                            .dwattr $C$DW$T$235, DW_AT_language(DW_LANG_C)
    7299                            .dwattr $C$DW$T$235, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    7300                            .dwattr $C$DW$T$235, DW_AT_decl_line(0x23c)
    7301                            .dwattr $C$DW$T$235, DW_AT_decl_column(0x03)
    7302                    
    7303                    
    7304                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7305                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x4c)
    7306                    $C$DW$672       .dwtag  DW_TAG_member
    7307                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$6)
    7308                            .dwattr $C$DW$672, DW_AT_name("SsidLen")
    7309                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("SsidLen")
    7310                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7311                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    7312                            .dwattr $C$DW$672, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  134

    7313                            .dwattr $C$DW$672, DW_AT_decl_line(0x24f)
    7314                            .dwattr $C$DW$672, DW_AT_decl_column(0x0d)
    7315                    
    7316                    $C$DW$673       .dwtag  DW_TAG_member
    7317                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$23)
    7318                            .dwattr $C$DW$673, DW_AT_name("SsidName")
    7319                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("SsidName")
    7320                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7321                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    7322                            .dwattr $C$DW$673, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7323                            .dwattr $C$DW$673, DW_AT_decl_line(0x250)
    7324                            .dwattr $C$DW$673, DW_AT_decl_column(0x0d)
    7325                    
    7326                    $C$DW$674       .dwtag  DW_TAG_member
    7327                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$24)
    7328                            .dwattr $C$DW$674, DW_AT_name("Bssid")
    7329                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("Bssid")
    7330                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7331                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7332                            .dwattr $C$DW$674, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7333                            .dwattr $C$DW$674, DW_AT_decl_line(0x251)
    7334                            .dwattr $C$DW$674, DW_AT_decl_column(0x0d)
    7335                    
    7336                    $C$DW$675       .dwtag  DW_TAG_member
    7337                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$6)
    7338                            .dwattr $C$DW$675, DW_AT_name("Reserved")
    7339                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("Reserved")
    7340                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    7341                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    7342                            .dwattr $C$DW$675, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7343                            .dwattr $C$DW$675, DW_AT_decl_line(0x252)
    7344                            .dwattr $C$DW$675, DW_AT_decl_column(0x0d)
    7345                    
    7346                    $C$DW$676       .dwtag  DW_TAG_member
    7347                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$6)
    7348                            .dwattr $C$DW$676, DW_AT_name("GoDeviceNameLen")
    7349                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("GoDeviceNameLen")
    7350                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7351                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    7352                            .dwattr $C$DW$676, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7353                            .dwattr $C$DW$676, DW_AT_decl_line(0x253)
    7354                            .dwattr $C$DW$676, DW_AT_decl_column(0x0d)
    7355                    
    7356                    $C$DW$677       .dwtag  DW_TAG_member
    7357                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$23)
    7358                            .dwattr $C$DW$677, DW_AT_name("GoDeviceName")
    7359                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("GoDeviceName")
    7360                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    7361                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7362                            .dwattr $C$DW$677, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7363                            .dwattr $C$DW$677, DW_AT_decl_line(0x254)
    7364                            .dwattr $C$DW$677, DW_AT_decl_column(0x0d)
    7365                    
    7366                    $C$DW$678       .dwtag  DW_TAG_member
    7367                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$26)
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  135

    7368                            .dwattr $C$DW$678, DW_AT_name("Padding")
    7369                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("Padding")
    7370                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    7371                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7372                            .dwattr $C$DW$678, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7373                            .dwattr $C$DW$678, DW_AT_decl_line(0x255)
    7374                            .dwattr $C$DW$678, DW_AT_decl_column(0x0d)
    7375                    
    7376                            .dwattr $C$DW$T$27, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7377                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x24e)
    7378                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    7379                            .dwendtag $C$DW$T$27
    7380                    
    7381                    $C$DW$T$236     .dwtag  DW_TAG_typedef
    7382                            .dwattr $C$DW$T$236, DW_AT_name("SlWlanEventP2PConnect_t")
    7383                            .dwattr $C$DW$T$236, DW_AT_type(*$C$DW$T$27)
    7384                            .dwattr $C$DW$T$236, DW_AT_language(DW_LANG_C)
    7385                            .dwattr $C$DW$T$236, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    7386                            .dwattr $C$DW$T$236, DW_AT_decl_line(0x256)
    7387                            .dwattr $C$DW$T$236, DW_AT_decl_column(0x03)
    7388                    
    7389                    
    7390                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7391                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x50)
    7392                    $C$DW$679       .dwtag  DW_TAG_member
    7393                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$6)
    7394                            .dwattr $C$DW$679, DW_AT_name("Mode")
    7395                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("Mode")
    7396                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7397                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7398                            .dwattr $C$DW$679, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7399                            .dwattr $C$DW$679, DW_AT_decl_line(0x304)
    7400                            .dwattr $C$DW$679, DW_AT_decl_column(0x09)
    7401                    
    7402                    $C$DW$680       .dwtag  DW_TAG_member
    7403                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$6)
    7404                            .dwattr $C$DW$680, DW_AT_name("ConnStatus")
    7405                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("ConnStatus")
    7406                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7407                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7408                            .dwattr $C$DW$680, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7409                            .dwattr $C$DW$680, DW_AT_decl_line(0x305)
    7410                            .dwattr $C$DW$680, DW_AT_decl_column(0x09)
    7411                    
    7412                    $C$DW$681       .dwtag  DW_TAG_member
    7413                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$6)
    7414                            .dwattr $C$DW$681, DW_AT_name("SecType")
    7415                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("SecType")
    7416                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7417                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7418                            .dwattr $C$DW$681, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7419                            .dwattr $C$DW$681, DW_AT_decl_line(0x306)
    7420                            .dwattr $C$DW$681, DW_AT_decl_column(0x09)
    7421                    
    7422                    $C$DW$682       .dwtag  DW_TAG_member
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  136

    7423                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$6)
    7424                            .dwattr $C$DW$682, DW_AT_name("Reserved")
    7425                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("Reserved")
    7426                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    7427                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7428                            .dwattr $C$DW$682, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7429                            .dwattr $C$DW$682, DW_AT_decl_line(0x307)
    7430                            .dwattr $C$DW$682, DW_AT_decl_column(0x09)
    7431                    
    7432                    $C$DW$683       .dwtag  DW_TAG_member
    7433                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$28)
    7434                            .dwattr $C$DW$683, DW_AT_name("ConnectionInfo")
    7435                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("ConnectionInfo")
    7436                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7437                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7438                            .dwattr $C$DW$683, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7439                            .dwattr $C$DW$683, DW_AT_decl_line(0x308)
    7440                            .dwattr $C$DW$683, DW_AT_decl_column(0x1c)
    7441                    
    7442                            .dwattr $C$DW$T$29, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7443                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x303)
    7444                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    7445                            .dwendtag $C$DW$T$29
    7446                    
    7447                    $C$DW$T$561     .dwtag  DW_TAG_typedef
    7448                            .dwattr $C$DW$T$561, DW_AT_name("SlWlanConnStatusParam_t")
    7449                            .dwattr $C$DW$T$561, DW_AT_type(*$C$DW$T$29)
    7450                            .dwattr $C$DW$T$561, DW_AT_language(DW_LANG_C)
    7451                            .dwattr $C$DW$T$561, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    7452                            .dwattr $C$DW$T$561, DW_AT_decl_line(0x309)
    7453                            .dwattr $C$DW$T$561, DW_AT_decl_column(0x02)
    7454                    
    7455                    
    7456                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7457                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    7458                    $C$DW$684       .dwtag  DW_TAG_member
    7459                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$14)
    7460                            .dwattr $C$DW$684, DW_AT_name("__max_align1")
    7461                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("__max_align1")
    7462                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7463                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7464                            .dwattr $C$DW$684, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7465                            .dwattr $C$DW$684, DW_AT_decl_line(0x7a)
    7466                            .dwattr $C$DW$684, DW_AT_decl_column(0x0c)
    7467                    
    7468                    $C$DW$685       .dwtag  DW_TAG_member
    7469                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$18)
    7470                            .dwattr $C$DW$685, DW_AT_name("__max_align2")
    7471                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("__max_align2")
    7472                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7473                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7474                            .dwattr $C$DW$685, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7475                            .dwattr $C$DW$685, DW_AT_decl_line(0x7b)
    7476                            .dwattr $C$DW$685, DW_AT_decl_column(0x0e)
    7477                    
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  137

    7478                            .dwattr $C$DW$T$30, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.
    7479                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x79)
    7480                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    7481                            .dwendtag $C$DW$T$30
    7482                    
    7483                    $C$DW$T$563     .dwtag  DW_TAG_typedef
    7484                            .dwattr $C$DW$T$563, DW_AT_name("__max_align_t")
    7485                            .dwattr $C$DW$T$563, DW_AT_type(*$C$DW$T$30)
    7486                            .dwattr $C$DW$T$563, DW_AT_language(DW_LANG_C)
    7487                            .dwattr $C$DW$T$563, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2
    7488                            .dwattr $C$DW$T$563, DW_AT_decl_line(0x7c)
    7489                            .dwattr $C$DW$T$563, DW_AT_decl_column(0x03)
    7490                    
    7491                    
    7492                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    7493                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
    7494                    $C$DW$686       .dwtag  DW_TAG_member
    7495                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$8)
    7496                            .dwattr $C$DW$686, DW_AT_name("daylight")
    7497                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("daylight")
    7498                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7499                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7500                            .dwattr $C$DW$686, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7501                            .dwattr $C$DW$686, DW_AT_decl_line(0x9b)
    7502                            .dwattr $C$DW$686, DW_AT_decl_column(0x0b)
    7503                    
    7504                    $C$DW$687       .dwtag  DW_TAG_member
    7505                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$12)
    7506                            .dwattr $C$DW$687, DW_AT_name("timezone")
    7507                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("timezone")
    7508                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7509                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7510                            .dwattr $C$DW$687, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7511                            .dwattr $C$DW$687, DW_AT_decl_line(0x9c)
    7512                            .dwattr $C$DW$687, DW_AT_decl_column(0x0b)
    7513                    
    7514                    $C$DW$688       .dwtag  DW_TAG_member
    7515                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$32)
    7516                            .dwattr $C$DW$688, DW_AT_name("tzname")
    7517                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("tzname")
    7518                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7519                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7520                            .dwattr $C$DW$688, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7521                            .dwattr $C$DW$688, DW_AT_decl_line(0x9d)
    7522                            .dwattr $C$DW$688, DW_AT_decl_column(0x0b)
    7523                    
    7524                    $C$DW$689       .dwtag  DW_TAG_member
    7525                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$32)
    7526                            .dwattr $C$DW$689, DW_AT_name("dstname")
    7527                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("dstname")
    7528                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7529                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7530                            .dwattr $C$DW$689, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7531                            .dwattr $C$DW$689, DW_AT_decl_line(0x9e)
    7532                            .dwattr $C$DW$689, DW_AT_decl_column(0x0b)
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  138

    7533                    
    7534                            .dwattr $C$DW$T$33, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.
    7535                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x9a)
    7536                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    7537                            .dwendtag $C$DW$T$33
    7538                    
    7539                    $C$DW$T$564     .dwtag  DW_TAG_typedef
    7540                            .dwattr $C$DW$T$564, DW_AT_name("TZ")
    7541                            .dwattr $C$DW$T$564, DW_AT_type(*$C$DW$T$33)
    7542                            .dwattr $C$DW$T$564, DW_AT_language(DW_LANG_C)
    7543                            .dwattr $C$DW$T$564, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2
    7544                            .dwattr $C$DW$T$564, DW_AT_decl_line(0x9f)
    7545                            .dwattr $C$DW$T$564, DW_AT_decl_column(0x03)
    7546                    
    7547                    
    7548                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    7549                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    7550                    $C$DW$690       .dwtag  DW_TAG_member
    7551                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$36)
    7552                            .dwattr $C$DW$690, DW_AT_name("pEntry")
    7553                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("pEntry")
    7554                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7555                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7556                            .dwattr $C$DW$690, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7557                            .dwattr $C$DW$690, DW_AT_decl_line(0x7c)
    7558                            .dwattr $C$DW$690, DW_AT_decl_column(0x16)
    7559                    
    7560                    $C$DW$691       .dwtag  DW_TAG_member
    7561                            .dwattr $C$DW$691, DW_AT_type(*$C$DW$T$3)
    7562                            .dwattr $C$DW$691, DW_AT_name("pValue")
    7563                            .dwattr $C$DW$691, DW_AT_TI_symbol_name("pValue")
    7564                            .dwattr $C$DW$691, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7565                            .dwattr $C$DW$691, DW_AT_accessibility(DW_ACCESS_public)
    7566                            .dwattr $C$DW$691, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7567                            .dwattr $C$DW$691, DW_AT_decl_line(0x7d)
    7568                            .dwattr $C$DW$691, DW_AT_decl_column(0x0b)
    7569                    
    7570                            .dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7571                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x7b)
    7572                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    7573                            .dwendtag $C$DW$T$37
    7574                    
    7575                    $C$DW$T$565     .dwtag  DW_TAG_typedef
    7576                            .dwattr $C$DW$T$565, DW_AT_name("tSimpleLinkSpawnMsg")
    7577                            .dwattr $C$DW$T$565, DW_AT_type(*$C$DW$T$37)
    7578                            .dwattr $C$DW$T$565, DW_AT_language(DW_LANG_C)
    7579                            .dwattr $C$DW$T$565, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    7580                            .dwattr $C$DW$T$565, DW_AT_decl_line(0x7e)
    7581                            .dwattr $C$DW$T$565, DW_AT_decl_column(0x02)
    7582                    
    7583                    
    7584                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    7585                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    7586                    $C$DW$692       .dwtag  DW_TAG_member
    7587                            .dwattr $C$DW$692, DW_AT_type(*$C$DW$T$10)
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  139

    7588                            .dwattr $C$DW$692, DW_AT_name("quot")
    7589                            .dwattr $C$DW$692, DW_AT_TI_symbol_name("quot")
    7590                            .dwattr $C$DW$692, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7591                            .dwattr $C$DW$692, DW_AT_accessibility(DW_ACCESS_public)
    7592                            .dwattr $C$DW$692, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7593                            .dwattr $C$DW$692, DW_AT_decl_line(0x4b)
    7594                            .dwattr $C$DW$692, DW_AT_decl_column(0x16)
    7595                    
    7596                    $C$DW$693       .dwtag  DW_TAG_member
    7597                            .dwattr $C$DW$693, DW_AT_type(*$C$DW$T$10)
    7598                            .dwattr $C$DW$693, DW_AT_name("rem")
    7599                            .dwattr $C$DW$693, DW_AT_TI_symbol_name("rem")
    7600                            .dwattr $C$DW$693, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7601                            .dwattr $C$DW$693, DW_AT_accessibility(DW_ACCESS_public)
    7602                            .dwattr $C$DW$693, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7603                            .dwattr $C$DW$693, DW_AT_decl_line(0x4b)
    7604                            .dwattr $C$DW$693, DW_AT_decl_column(0x1c)
    7605                    
    7606                            .dwattr $C$DW$T$38, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.
    7607                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    7608                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    7609                            .dwendtag $C$DW$T$38
    7610                    
    7611                    $C$DW$T$566     .dwtag  DW_TAG_typedef
    7612                            .dwattr $C$DW$T$566, DW_AT_name("div_t")
    7613                            .dwattr $C$DW$T$566, DW_AT_type(*$C$DW$T$38)
    7614                            .dwattr $C$DW$T$566, DW_AT_language(DW_LANG_C)
    7615                            .dwattr $C$DW$T$566, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2
    7616                            .dwattr $C$DW$T$566, DW_AT_decl_line(0x4b)
    7617                            .dwattr $C$DW$T$566, DW_AT_decl_column(0x23)
    7618                    
    7619                    
    7620                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    7621                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    7622                    $C$DW$694       .dwtag  DW_TAG_member
    7623                            .dwattr $C$DW$694, DW_AT_type(*$C$DW$T$10)
    7624                            .dwattr $C$DW$694, DW_AT_name("quot")
    7625                            .dwattr $C$DW$694, DW_AT_TI_symbol_name("quot")
    7626                            .dwattr $C$DW$694, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7627                            .dwattr $C$DW$694, DW_AT_accessibility(DW_ACCESS_public)
    7628                            .dwattr $C$DW$694, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7629                            .dwattr $C$DW$694, DW_AT_decl_line(0x50)
    7630                            .dwattr $C$DW$694, DW_AT_decl_column(0x16)
    7631                    
    7632                    $C$DW$695       .dwtag  DW_TAG_member
    7633                            .dwattr $C$DW$695, DW_AT_type(*$C$DW$T$10)
    7634                            .dwattr $C$DW$695, DW_AT_name("rem")
    7635                            .dwattr $C$DW$695, DW_AT_TI_symbol_name("rem")
    7636                            .dwattr $C$DW$695, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7637                            .dwattr $C$DW$695, DW_AT_accessibility(DW_ACCESS_public)
    7638                            .dwattr $C$DW$695, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7639                            .dwattr $C$DW$695, DW_AT_decl_line(0x50)
    7640                            .dwattr $C$DW$695, DW_AT_decl_column(0x1c)
    7641                    
    7642                            .dwattr $C$DW$T$39, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  140

    7643                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x50)
    7644                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    7645                            .dwendtag $C$DW$T$39
    7646                    
    7647                    $C$DW$T$567     .dwtag  DW_TAG_typedef
    7648                            .dwattr $C$DW$T$567, DW_AT_name("ldiv_t")
    7649                            .dwattr $C$DW$T$567, DW_AT_type(*$C$DW$T$39)
    7650                            .dwattr $C$DW$T$567, DW_AT_language(DW_LANG_C)
    7651                            .dwattr $C$DW$T$567, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2
    7652                            .dwattr $C$DW$T$567, DW_AT_decl_line(0x50)
    7653                            .dwattr $C$DW$T$567, DW_AT_decl_column(0x23)
    7654                    
    7655                    
    7656                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    7657                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
    7658                    $C$DW$696       .dwtag  DW_TAG_member
    7659                            .dwattr $C$DW$696, DW_AT_type(*$C$DW$T$14)
    7660                            .dwattr $C$DW$696, DW_AT_name("quot")
    7661                            .dwattr $C$DW$696, DW_AT_TI_symbol_name("quot")
    7662                            .dwattr $C$DW$696, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7663                            .dwattr $C$DW$696, DW_AT_accessibility(DW_ACCESS_public)
    7664                            .dwattr $C$DW$696, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7665                            .dwattr $C$DW$696, DW_AT_decl_line(0x58)
    7666                            .dwattr $C$DW$696, DW_AT_decl_column(0x1c)
    7667                    
    7668                    $C$DW$697       .dwtag  DW_TAG_member
    7669                            .dwattr $C$DW$697, DW_AT_type(*$C$DW$T$14)
    7670                            .dwattr $C$DW$697, DW_AT_name("rem")
    7671                            .dwattr $C$DW$697, DW_AT_TI_symbol_name("rem")
    7672                            .dwattr $C$DW$697, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7673                            .dwattr $C$DW$697, DW_AT_accessibility(DW_ACCESS_public)
    7674                            .dwattr $C$DW$697, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.L
    7675                            .dwattr $C$DW$697, DW_AT_decl_line(0x58)
    7676                            .dwattr $C$DW$697, DW_AT_decl_column(0x22)
    7677                    
    7678                            .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2.
    7679                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x58)
    7680                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    7681                            .dwendtag $C$DW$T$40
    7682                    
    7683                    $C$DW$T$568     .dwtag  DW_TAG_typedef
    7684                            .dwattr $C$DW$T$568, DW_AT_name("lldiv_t")
    7685                            .dwattr $C$DW$T$568, DW_AT_type(*$C$DW$T$40)
    7686                            .dwattr $C$DW$T$568, DW_AT_language(DW_LANG_C)
    7687                            .dwattr $C$DW$T$568, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_18.12.2
    7688                            .dwattr $C$DW$T$568, DW_AT_decl_line(0x58)
    7689                            .dwattr $C$DW$T$568, DW_AT_decl_column(0x29)
    7690                    
    7691                    
    7692                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    7693                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x24)
    7694                    $C$DW$698       .dwtag  DW_TAG_member
    7695                            .dwattr $C$DW$698, DW_AT_type(*$C$DW$T$9)
    7696                            .dwattr $C$DW$698, DW_AT_name("Flags")
    7697                            .dwattr $C$DW$698, DW_AT_TI_symbol_name("Flags")
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  141

    7698                            .dwattr $C$DW$698, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7699                            .dwattr $C$DW$698, DW_AT_accessibility(DW_ACCESS_public)
    7700                            .dwattr $C$DW$698, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7701                            .dwattr $C$DW$698, DW_AT_decl_line(0x90)
    7702                            .dwattr $C$DW$698, DW_AT_decl_column(0x0b)
    7703                    
    7704                    $C$DW$699       .dwtag  DW_TAG_member
    7705                            .dwattr $C$DW$699, DW_AT_type(*$C$DW$T$13)
    7706                            .dwattr $C$DW$699, DW_AT_name("Len")
    7707                            .dwattr $C$DW$699, DW_AT_TI_symbol_name("Len")
    7708                            .dwattr $C$DW$699, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7709                            .dwattr $C$DW$699, DW_AT_accessibility(DW_ACCESS_public)
    7710                            .dwattr $C$DW$699, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7711                            .dwattr $C$DW$699, DW_AT_decl_line(0x91)
    7712                            .dwattr $C$DW$699, DW_AT_decl_column(0x0b)
    7713                    
    7714                    $C$DW$700       .dwtag  DW_TAG_member
    7715                            .dwattr $C$DW$700, DW_AT_type(*$C$DW$T$13)
    7716                            .dwattr $C$DW$700, DW_AT_name("MaxSize")
    7717                            .dwattr $C$DW$700, DW_AT_TI_symbol_name("MaxSize")
    7718                            .dwattr $C$DW$700, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7719                            .dwattr $C$DW$700, DW_AT_accessibility(DW_ACCESS_public)
    7720                            .dwattr $C$DW$700, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7721                            .dwattr $C$DW$700, DW_AT_decl_line(0x92)
    7722                            .dwattr $C$DW$700, DW_AT_decl_column(0x0b)
    7723                    
    7724                    $C$DW$701       .dwtag  DW_TAG_member
    7725                            .dwattr $C$DW$701, DW_AT_type(*$C$DW$T$41)
    7726                            .dwattr $C$DW$701, DW_AT_name("Token")
    7727                            .dwattr $C$DW$701, DW_AT_TI_symbol_name("Token")
    7728                            .dwattr $C$DW$701, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7729                            .dwattr $C$DW$701, DW_AT_accessibility(DW_ACCESS_public)
    7730                            .dwattr $C$DW$701, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7731                            .dwattr $C$DW$701, DW_AT_decl_line(0x93)
    7732                            .dwattr $C$DW$701, DW_AT_decl_column(0x0b)
    7733                    
    7734                    $C$DW$702       .dwtag  DW_TAG_member
    7735                            .dwattr $C$DW$702, DW_AT_type(*$C$DW$T$13)
    7736                            .dwattr $C$DW$702, DW_AT_name("StorageSize")
    7737                            .dwattr $C$DW$702, DW_AT_TI_symbol_name("StorageSize")
    7738                            .dwattr $C$DW$702, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7739                            .dwattr $C$DW$702, DW_AT_accessibility(DW_ACCESS_public)
    7740                            .dwattr $C$DW$702, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7741                            .dwattr $C$DW$702, DW_AT_decl_line(0x94)
    7742                            .dwattr $C$DW$702, DW_AT_decl_column(0x0b)
    7743                    
    7744                    $C$DW$703       .dwtag  DW_TAG_member
    7745                            .dwattr $C$DW$703, DW_AT_type(*$C$DW$T$13)
    7746                            .dwattr $C$DW$703, DW_AT_name("WriteCounter")
    7747                            .dwattr $C$DW$703, DW_AT_TI_symbol_name("WriteCounter")
    7748                            .dwattr $C$DW$703, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7749                            .dwattr $C$DW$703, DW_AT_accessibility(DW_ACCESS_public)
    7750                            .dwattr $C$DW$703, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7751                            .dwattr $C$DW$703, DW_AT_decl_line(0x95)
    7752                            .dwattr $C$DW$703, DW_AT_decl_column(0x0b)
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  142

    7753                    
    7754                            .dwattr $C$DW$T$42, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7755                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x8f)
    7756                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    7757                            .dwendtag $C$DW$T$42
    7758                    
    7759                    $C$DW$T$569     .dwtag  DW_TAG_typedef
    7760                            .dwattr $C$DW$T$569, DW_AT_name("SlFsFileInfo_t")
    7761                            .dwattr $C$DW$T$569, DW_AT_type(*$C$DW$T$42)
    7762                            .dwattr $C$DW$T$569, DW_AT_language(DW_LANG_C)
    7763                            .dwattr $C$DW$T$569, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    7764                            .dwattr $C$DW$T$569, DW_AT_decl_line(0x96)
    7765                            .dwattr $C$DW$T$569, DW_AT_decl_column(0x02)
    7766                    
    7767                    
    7768                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    7769                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x10)
    7770                    $C$DW$704       .dwtag  DW_TAG_member
    7771                            .dwattr $C$DW$704, DW_AT_type(*$C$DW$T$41)
    7772                            .dwattr $C$DW$704, DW_AT_name("Key")
    7773                            .dwattr $C$DW$704, DW_AT_TI_symbol_name("Key")
    7774                            .dwattr $C$DW$704, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7775                            .dwattr $C$DW$704, DW_AT_accessibility(DW_ACCESS_public)
    7776                            .dwattr $C$DW$704, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7777                            .dwattr $C$DW$704, DW_AT_decl_line(0xb1)
    7778                            .dwattr $C$DW$704, DW_AT_decl_column(0x0b)
    7779                    
    7780                            .dwattr $C$DW$T$43, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7781                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xb0)
    7782                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    7783                            .dwendtag $C$DW$T$43
    7784                    
    7785                    $C$DW$T$570     .dwtag  DW_TAG_typedef
    7786                            .dwattr $C$DW$T$570, DW_AT_name("SlFsKey_t")
    7787                            .dwattr $C$DW$T$570, DW_AT_type(*$C$DW$T$43)
    7788                            .dwattr $C$DW$T$570, DW_AT_language(DW_LANG_C)
    7789                            .dwattr $C$DW$T$570, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    7790                            .dwattr $C$DW$T$570, DW_AT_decl_line(0xb2)
    7791                            .dwattr $C$DW$T$570, DW_AT_decl_column(0x02)
    7792                    
    7793                    
    7794                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    7795                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    7796                    $C$DW$705       .dwtag  DW_TAG_member
    7797                            .dwattr $C$DW$705, DW_AT_type(*$C$DW$T$6)
    7798                            .dwattr $C$DW$705, DW_AT_name("Index")
    7799                            .dwattr $C$DW$705, DW_AT_TI_symbol_name("Index")
    7800                            .dwattr $C$DW$705, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7801                            .dwattr $C$DW$705, DW_AT_accessibility(DW_ACCESS_public)
    7802                            .dwattr $C$DW$705, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7803                            .dwattr $C$DW$705, DW_AT_decl_line(0xb6)
    7804                            .dwattr $C$DW$705, DW_AT_decl_column(0x09)
    7805                    
    7806                            .dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7807                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xb5)
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  143

    7808                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    7809                            .dwendtag $C$DW$T$44
    7810                    
    7811                    $C$DW$T$243     .dwtag  DW_TAG_typedef
    7812                            .dwattr $C$DW$T$243, DW_AT_name("SlFsFileNameIndex_t")
    7813                            .dwattr $C$DW$T$243, DW_AT_type(*$C$DW$T$44)
    7814                            .dwattr $C$DW$T$243, DW_AT_language(DW_LANG_C)
    7815                            .dwattr $C$DW$T$243, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    7816                            .dwattr $C$DW$T$243, DW_AT_decl_line(0xb7)
    7817                            .dwattr $C$DW$T$243, DW_AT_decl_column(0x02)
    7818                    
    7819                    
    7820                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    7821                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    7822                    $C$DW$706       .dwtag  DW_TAG_member
    7823                            .dwattr $C$DW$706, DW_AT_type(*$C$DW$T$13)
    7824                            .dwattr $C$DW$706, DW_AT_name("Operation")
    7825                            .dwattr $C$DW$706, DW_AT_TI_symbol_name("Operation")
    7826                            .dwattr $C$DW$706, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7827                            .dwattr $C$DW$706, DW_AT_accessibility(DW_ACCESS_public)
    7828                            .dwattr $C$DW$706, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7829                            .dwattr $C$DW$706, DW_AT_decl_line(0xca)
    7830                            .dwattr $C$DW$706, DW_AT_decl_column(0x08)
    7831                    
    7832                            .dwattr $C$DW$T$45, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7833                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xc9)
    7834                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    7835                            .dwendtag $C$DW$T$45
    7836                    
    7837                    $C$DW$T$571     .dwtag  DW_TAG_typedef
    7838                            .dwattr $C$DW$T$571, DW_AT_name("SlFsRetToFactoryCommand_t")
    7839                            .dwattr $C$DW$T$571, DW_AT_type(*$C$DW$T$45)
    7840                            .dwattr $C$DW$T$571, DW_AT_language(DW_LANG_C)
    7841                            .dwattr $C$DW$T$571, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    7842                            .dwattr $C$DW$T$571, DW_AT_decl_line(0xcb)
    7843                            .dwattr $C$DW$T$571, DW_AT_decl_column(0x02)
    7844                    
    7845                    
    7846                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    7847                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    7848                    $C$DW$707       .dwtag  DW_TAG_member
    7849                            .dwattr $C$DW$707, DW_AT_type(*$C$DW$T$13)
    7850                            .dwattr $C$DW$707, DW_AT_name("IncludeFilters")
    7851                            .dwattr $C$DW$707, DW_AT_TI_symbol_name("IncludeFilters")
    7852                            .dwattr $C$DW$707, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7853                            .dwattr $C$DW$707, DW_AT_accessibility(DW_ACCESS_public)
    7854                            .dwattr $C$DW$707, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7855                            .dwattr $C$DW$707, DW_AT_decl_line(0xd1)
    7856                            .dwattr $C$DW$707, DW_AT_decl_column(0x12)
    7857                    
    7858                            .dwattr $C$DW$T$46, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7859                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xd0)
    7860                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    7861                            .dwendtag $C$DW$T$46
    7862                    
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  144

    7863                    $C$DW$T$572     .dwtag  DW_TAG_typedef
    7864                            .dwattr $C$DW$T$572, DW_AT_name("SlFsControl_t")
    7865                            .dwattr $C$DW$T$572, DW_AT_type(*$C$DW$T$46)
    7866                            .dwattr $C$DW$T$572, DW_AT_language(DW_LANG_C)
    7867                            .dwattr $C$DW$T$572, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    7868                            .dwattr $C$DW$T$572, DW_AT_decl_line(0xd3)
    7869                            .dwattr $C$DW$T$572, DW_AT_decl_column(0x02)
    7870                    
    7871                    
    7872                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    7873                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x10)
    7874                    $C$DW$708       .dwtag  DW_TAG_member
    7875                            .dwattr $C$DW$708, DW_AT_type(*$C$DW$T$9)
    7876                            .dwattr $C$DW$708, DW_AT_name("DeviceBlockSize")
    7877                            .dwattr $C$DW$708, DW_AT_TI_symbol_name("DeviceBlockSize")
    7878                            .dwattr $C$DW$708, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7879                            .dwattr $C$DW$708, DW_AT_accessibility(DW_ACCESS_public)
    7880                            .dwattr $C$DW$708, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7881                            .dwattr $C$DW$708, DW_AT_decl_line(0xd7)
    7882                            .dwattr $C$DW$708, DW_AT_decl_column(0x08)
    7883                    
    7884                    $C$DW$709       .dwtag  DW_TAG_member
    7885                            .dwattr $C$DW$709, DW_AT_type(*$C$DW$T$9)
    7886                            .dwattr $C$DW$709, DW_AT_name("DeviceBlocksCapacity")
    7887                            .dwattr $C$DW$709, DW_AT_TI_symbol_name("DeviceBlocksCapacity")
    7888                            .dwattr $C$DW$709, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7889                            .dwattr $C$DW$709, DW_AT_accessibility(DW_ACCESS_public)
    7890                            .dwattr $C$DW$709, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7891                            .dwattr $C$DW$709, DW_AT_decl_line(0xd8)
    7892                            .dwattr $C$DW$709, DW_AT_decl_column(0x08)
    7893                    
    7894                    $C$DW$710       .dwtag  DW_TAG_member
    7895                            .dwattr $C$DW$710, DW_AT_type(*$C$DW$T$9)
    7896                            .dwattr $C$DW$710, DW_AT_name("NumOfAllocatedBlocks")
    7897                            .dwattr $C$DW$710, DW_AT_TI_symbol_name("NumOfAllocatedBlocks")
    7898                            .dwattr $C$DW$710, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7899                            .dwattr $C$DW$710, DW_AT_accessibility(DW_ACCESS_public)
    7900                            .dwattr $C$DW$710, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7901                            .dwattr $C$DW$710, DW_AT_decl_line(0xd9)
    7902                            .dwattr $C$DW$710, DW_AT_decl_column(0x08)
    7903                    
    7904                    $C$DW$711       .dwtag  DW_TAG_member
    7905                            .dwattr $C$DW$711, DW_AT_type(*$C$DW$T$9)
    7906                            .dwattr $C$DW$711, DW_AT_name("NumOfReservedBlocks")
    7907                            .dwattr $C$DW$711, DW_AT_TI_symbol_name("NumOfReservedBlocks")
    7908                            .dwattr $C$DW$711, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7909                            .dwattr $C$DW$711, DW_AT_accessibility(DW_ACCESS_public)
    7910                            .dwattr $C$DW$711, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7911                            .dwattr $C$DW$711, DW_AT_decl_line(0xda)
    7912                            .dwattr $C$DW$711, DW_AT_decl_column(0x08)
    7913                    
    7914                    $C$DW$712       .dwtag  DW_TAG_member
    7915                            .dwattr $C$DW$712, DW_AT_type(*$C$DW$T$9)
    7916                            .dwattr $C$DW$712, DW_AT_name("NumOfReservedBlocksForSystemfiles")
    7917                            .dwattr $C$DW$712, DW_AT_TI_symbol_name("NumOfReservedBlocksForSystemfiles")
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  145

    7918                            .dwattr $C$DW$712, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7919                            .dwattr $C$DW$712, DW_AT_accessibility(DW_ACCESS_public)
    7920                            .dwattr $C$DW$712, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7921                            .dwattr $C$DW$712, DW_AT_decl_line(0xdb)
    7922                            .dwattr $C$DW$712, DW_AT_decl_column(0x08)
    7923                    
    7924                    $C$DW$713       .dwtag  DW_TAG_member
    7925                            .dwattr $C$DW$713, DW_AT_type(*$C$DW$T$9)
    7926                            .dwattr $C$DW$713, DW_AT_name("LargestAllocatedGapInBlocks")
    7927                            .dwattr $C$DW$713, DW_AT_TI_symbol_name("LargestAllocatedGapInBlocks")
    7928                            .dwattr $C$DW$713, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7929                            .dwattr $C$DW$713, DW_AT_accessibility(DW_ACCESS_public)
    7930                            .dwattr $C$DW$713, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7931                            .dwattr $C$DW$713, DW_AT_decl_line(0xdc)
    7932                            .dwattr $C$DW$713, DW_AT_decl_column(0x08)
    7933                    
    7934                    $C$DW$714       .dwtag  DW_TAG_member
    7935                            .dwattr $C$DW$714, DW_AT_type(*$C$DW$T$9)
    7936                            .dwattr $C$DW$714, DW_AT_name("NumOfAvailableBlocksForUserFiles")
    7937                            .dwattr $C$DW$714, DW_AT_TI_symbol_name("NumOfAvailableBlocksForUserFiles")
    7938                            .dwattr $C$DW$714, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7939                            .dwattr $C$DW$714, DW_AT_accessibility(DW_ACCESS_public)
    7940                            .dwattr $C$DW$714, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7941                            .dwattr $C$DW$714, DW_AT_decl_line(0xdd)
    7942                            .dwattr $C$DW$714, DW_AT_decl_column(0x08)
    7943                    
    7944                    $C$DW$715       .dwtag  DW_TAG_member
    7945                            .dwattr $C$DW$715, DW_AT_type(*$C$DW$T$47)
    7946                            .dwattr $C$DW$715, DW_AT_name("Padding")
    7947                            .dwattr $C$DW$715, DW_AT_TI_symbol_name("Padding")
    7948                            .dwattr $C$DW$715, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7949                            .dwattr $C$DW$715, DW_AT_accessibility(DW_ACCESS_public)
    7950                            .dwattr $C$DW$715, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7951                            .dwattr $C$DW$715, DW_AT_decl_line(0xde)
    7952                            .dwattr $C$DW$715, DW_AT_decl_column(0x08)
    7953                    
    7954                            .dwattr $C$DW$T$48, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7955                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xd6)
    7956                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    7957                            .dwendtag $C$DW$T$48
    7958                    
    7959                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    7960                            .dwattr $C$DW$T$50, DW_AT_name("SlFsControlDeviceUsage_t")
    7961                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$48)
    7962                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    7963                            .dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    7964                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xdf)
    7965                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    7966                    
    7967                    
    7968                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    7969                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x14)
    7970                    $C$DW$716       .dwtag  DW_TAG_member
    7971                            .dwattr $C$DW$716, DW_AT_type(*$C$DW$T$6)
    7972                            .dwattr $C$DW$716, DW_AT_name("MaxFsFiles")
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  146

    7973                            .dwattr $C$DW$716, DW_AT_TI_symbol_name("MaxFsFiles")
    7974                            .dwattr $C$DW$716, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7975                            .dwattr $C$DW$716, DW_AT_accessibility(DW_ACCESS_public)
    7976                            .dwattr $C$DW$716, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7977                            .dwattr $C$DW$716, DW_AT_decl_line(0xe3)
    7978                            .dwattr $C$DW$716, DW_AT_decl_column(0x08)
    7979                    
    7980                    $C$DW$717       .dwtag  DW_TAG_member
    7981                            .dwattr $C$DW$717, DW_AT_type(*$C$DW$T$6)
    7982                            .dwattr $C$DW$717, DW_AT_name("IsDevlopmentFormatType")
    7983                            .dwattr $C$DW$717, DW_AT_TI_symbol_name("IsDevlopmentFormatType")
    7984                            .dwattr $C$DW$717, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    7985                            .dwattr $C$DW$717, DW_AT_accessibility(DW_ACCESS_public)
    7986                            .dwattr $C$DW$717, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7987                            .dwattr $C$DW$717, DW_AT_decl_line(0xe4)
    7988                            .dwattr $C$DW$717, DW_AT_decl_column(0x08)
    7989                    
    7990                    $C$DW$718       .dwtag  DW_TAG_member
    7991                            .dwattr $C$DW$718, DW_AT_type(*$C$DW$T$6)
    7992                            .dwattr $C$DW$718, DW_AT_name("Bundlestate")
    7993                            .dwattr $C$DW$718, DW_AT_TI_symbol_name("Bundlestate")
    7994                            .dwattr $C$DW$718, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7995                            .dwattr $C$DW$718, DW_AT_accessibility(DW_ACCESS_public)
    7996                            .dwattr $C$DW$718, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    7997                            .dwattr $C$DW$718, DW_AT_decl_line(0xe5)
    7998                            .dwattr $C$DW$718, DW_AT_decl_column(0x08)
    7999                    
    8000                    $C$DW$719       .dwtag  DW_TAG_member
    8001                            .dwattr $C$DW$719, DW_AT_type(*$C$DW$T$6)
    8002                            .dwattr $C$DW$719, DW_AT_name("Reserved")
    8003                            .dwattr $C$DW$719, DW_AT_TI_symbol_name("Reserved")
    8004                            .dwattr $C$DW$719, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8005                            .dwattr $C$DW$719, DW_AT_accessibility(DW_ACCESS_public)
    8006                            .dwattr $C$DW$719, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8007                            .dwattr $C$DW$719, DW_AT_decl_line(0xe6)
    8008                            .dwattr $C$DW$719, DW_AT_decl_column(0x08)
    8009                    
    8010                    $C$DW$720       .dwtag  DW_TAG_member
    8011                            .dwattr $C$DW$720, DW_AT_type(*$C$DW$T$6)
    8012                            .dwattr $C$DW$720, DW_AT_name("MaxFsFilesReservedForSysFiles")
    8013                            .dwattr $C$DW$720, DW_AT_TI_symbol_name("MaxFsFilesReservedForSysFiles")
    8014                            .dwattr $C$DW$720, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8015                            .dwattr $C$DW$720, DW_AT_accessibility(DW_ACCESS_public)
    8016                            .dwattr $C$DW$720, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8017                            .dwattr $C$DW$720, DW_AT_decl_line(0xe7)
    8018                            .dwattr $C$DW$720, DW_AT_decl_column(0x08)
    8019                    
    8020                    $C$DW$721       .dwtag  DW_TAG_member
    8021                            .dwattr $C$DW$721, DW_AT_type(*$C$DW$T$6)
    8022                            .dwattr $C$DW$721, DW_AT_name("ActualNumOfUserFiles")
    8023                            .dwattr $C$DW$721, DW_AT_TI_symbol_name("ActualNumOfUserFiles")
    8024                            .dwattr $C$DW$721, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8025                            .dwattr $C$DW$721, DW_AT_accessibility(DW_ACCESS_public)
    8026                            .dwattr $C$DW$721, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8027                            .dwattr $C$DW$721, DW_AT_decl_line(0xe8)
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  147

    8028                            .dwattr $C$DW$721, DW_AT_decl_column(0x08)
    8029                    
    8030                    $C$DW$722       .dwtag  DW_TAG_member
    8031                            .dwattr $C$DW$722, DW_AT_type(*$C$DW$T$6)
    8032                            .dwattr $C$DW$722, DW_AT_name("ActualNumOfSysFiles")
    8033                            .dwattr $C$DW$722, DW_AT_TI_symbol_name("ActualNumOfSysFiles")
    8034                            .dwattr $C$DW$722, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8035                            .dwattr $C$DW$722, DW_AT_accessibility(DW_ACCESS_public)
    8036                            .dwattr $C$DW$722, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8037                            .dwattr $C$DW$722, DW_AT_decl_line(0xe9)
    8038                            .dwattr $C$DW$722, DW_AT_decl_column(0x08)
    8039                    
    8040                    $C$DW$723       .dwtag  DW_TAG_member
    8041                            .dwattr $C$DW$723, DW_AT_type(*$C$DW$T$6)
    8042                            .dwattr $C$DW$723, DW_AT_name("Padding")
    8043                            .dwattr $C$DW$723, DW_AT_TI_symbol_name("Padding")
    8044                            .dwattr $C$DW$723, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8045                            .dwattr $C$DW$723, DW_AT_accessibility(DW_ACCESS_public)
    8046                            .dwattr $C$DW$723, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8047                            .dwattr $C$DW$723, DW_AT_decl_line(0xea)
    8048                            .dwattr $C$DW$723, DW_AT_decl_column(0x08)
    8049                    
    8050                    $C$DW$724       .dwtag  DW_TAG_member
    8051                            .dwattr $C$DW$724, DW_AT_type(*$C$DW$T$13)
    8052                            .dwattr $C$DW$724, DW_AT_name("NumOfAlerts")
    8053                            .dwattr $C$DW$724, DW_AT_TI_symbol_name("NumOfAlerts")
    8054                            .dwattr $C$DW$724, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8055                            .dwattr $C$DW$724, DW_AT_accessibility(DW_ACCESS_public)
    8056                            .dwattr $C$DW$724, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8057                            .dwattr $C$DW$724, DW_AT_decl_line(0xeb)
    8058                            .dwattr $C$DW$724, DW_AT_decl_column(0x08)
    8059                    
    8060                    $C$DW$725       .dwtag  DW_TAG_member
    8061                            .dwattr $C$DW$725, DW_AT_type(*$C$DW$T$13)
    8062                            .dwattr $C$DW$725, DW_AT_name("NumOfAlertsThreshold")
    8063                            .dwattr $C$DW$725, DW_AT_TI_symbol_name("NumOfAlertsThreshold")
    8064                            .dwattr $C$DW$725, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8065                            .dwattr $C$DW$725, DW_AT_accessibility(DW_ACCESS_public)
    8066                            .dwattr $C$DW$725, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8067                            .dwattr $C$DW$725, DW_AT_decl_line(0xec)
    8068                            .dwattr $C$DW$725, DW_AT_decl_column(0x08)
    8069                    
    8070                    $C$DW$726       .dwtag  DW_TAG_member
    8071                            .dwattr $C$DW$726, DW_AT_type(*$C$DW$T$9)
    8072                            .dwattr $C$DW$726, DW_AT_name("FATWriteCounter")
    8073                            .dwattr $C$DW$726, DW_AT_TI_symbol_name("FATWriteCounter")
    8074                            .dwattr $C$DW$726, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8075                            .dwattr $C$DW$726, DW_AT_accessibility(DW_ACCESS_public)
    8076                            .dwattr $C$DW$726, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8077                            .dwattr $C$DW$726, DW_AT_decl_line(0xed)
    8078                            .dwattr $C$DW$726, DW_AT_decl_column(0x08)
    8079                    
    8080                    $C$DW$727       .dwtag  DW_TAG_member
    8081                            .dwattr $C$DW$727, DW_AT_type(*$C$DW$T$9)
    8082                            .dwattr $C$DW$727, DW_AT_name("Padding2")
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  148

    8083                            .dwattr $C$DW$727, DW_AT_TI_symbol_name("Padding2")
    8084                            .dwattr $C$DW$727, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8085                            .dwattr $C$DW$727, DW_AT_accessibility(DW_ACCESS_public)
    8086                            .dwattr $C$DW$727, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8087                            .dwattr $C$DW$727, DW_AT_decl_line(0xee)
    8088                            .dwattr $C$DW$727, DW_AT_decl_column(0x08)
    8089                    
    8090                            .dwattr $C$DW$T$49, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    8091                            .dwattr $C$DW$T$49, DW_AT_decl_line(0xe2)
    8092                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    8093                            .dwendtag $C$DW$T$49
    8094                    
    8095                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    8096                            .dwattr $C$DW$T$51, DW_AT_name("SlFsControlFilesUsage_t")
    8097                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$49)
    8098                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    8099                            .dwattr $C$DW$T$51, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    8100                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xef)
    8101                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x02)
    8102                    
    8103                    
    8104                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    8105                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x24)
    8106                    $C$DW$728       .dwtag  DW_TAG_member
    8107                            .dwattr $C$DW$728, DW_AT_type(*$C$DW$T$50)
    8108                            .dwattr $C$DW$728, DW_AT_name("DeviceUsage")
    8109                            .dwattr $C$DW$728, DW_AT_TI_symbol_name("DeviceUsage")
    8110                            .dwattr $C$DW$728, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8111                            .dwattr $C$DW$728, DW_AT_accessibility(DW_ACCESS_public)
    8112                            .dwattr $C$DW$728, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8113                            .dwattr $C$DW$728, DW_AT_decl_line(0xf4)
    8114                            .dwattr $C$DW$728, DW_AT_decl_column(0x1e)
    8115                    
    8116                    $C$DW$729       .dwtag  DW_TAG_member
    8117                            .dwattr $C$DW$729, DW_AT_type(*$C$DW$T$51)
    8118                            .dwattr $C$DW$729, DW_AT_name("FilesUsage")
    8119                            .dwattr $C$DW$729, DW_AT_TI_symbol_name("FilesUsage")
    8120                            .dwattr $C$DW$729, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8121                            .dwattr $C$DW$729, DW_AT_accessibility(DW_ACCESS_public)
    8122                            .dwattr $C$DW$729, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8123                            .dwattr $C$DW$729, DW_AT_decl_line(0xf5)
    8124                            .dwattr $C$DW$729, DW_AT_decl_column(0x1e)
    8125                    
    8126                            .dwattr $C$DW$T$52, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    8127                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xf3)
    8128                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    8129                            .dwendtag $C$DW$T$52
    8130                    
    8131                    $C$DW$T$573     .dwtag  DW_TAG_typedef
    8132                            .dwattr $C$DW$T$573, DW_AT_name("SlFsControlGetStorageInfoResponse_t")
    8133                            .dwattr $C$DW$T$573, DW_AT_type(*$C$DW$T$52)
    8134                            .dwattr $C$DW$T$573, DW_AT_language(DW_LANG_C)
    8135                            .dwattr $C$DW$T$573, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    8136                            .dwattr $C$DW$T$573, DW_AT_decl_line(0xf6)
    8137                            .dwattr $C$DW$T$573, DW_AT_decl_column(0x03)
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  149

    8138                    
    8139                    
    8140                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    8141                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x0c)
    8142                    $C$DW$730       .dwtag  DW_TAG_member
    8143                            .dwattr $C$DW$730, DW_AT_type(*$C$DW$T$13)
    8144                            .dwattr $C$DW$730, DW_AT_name("IncludeFilters")
    8145                            .dwattr $C$DW$730, DW_AT_TI_symbol_name("IncludeFilters")
    8146                            .dwattr $C$DW$730, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8147                            .dwattr $C$DW$730, DW_AT_accessibility(DW_ACCESS_public)
    8148                            .dwattr $C$DW$730, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8149                            .dwattr $C$DW$730, DW_AT_decl_line(0xfa)
    8150                            .dwattr $C$DW$730, DW_AT_decl_column(0x0b)
    8151                    
    8152                    $C$DW$731       .dwtag  DW_TAG_member
    8153                            .dwattr $C$DW$731, DW_AT_type(*$C$DW$T$6)
    8154                            .dwattr $C$DW$731, DW_AT_name("OpenedForWriteCnt")
    8155                            .dwattr $C$DW$731, DW_AT_TI_symbol_name("OpenedForWriteCnt")
    8156                            .dwattr $C$DW$731, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8157                            .dwattr $C$DW$731, DW_AT_accessibility(DW_ACCESS_public)
    8158                            .dwattr $C$DW$731, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8159                            .dwattr $C$DW$731, DW_AT_decl_line(0xfb)
    8160                            .dwattr $C$DW$731, DW_AT_decl_column(0x0b)
    8161                    
    8162                    $C$DW$732       .dwtag  DW_TAG_member
    8163                            .dwattr $C$DW$732, DW_AT_type(*$C$DW$T$6)
    8164                            .dwattr $C$DW$732, DW_AT_name("OpeneForReadCnt")
    8165                            .dwattr $C$DW$732, DW_AT_TI_symbol_name("OpeneForReadCnt")
    8166                            .dwattr $C$DW$732, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8167                            .dwattr $C$DW$732, DW_AT_accessibility(DW_ACCESS_public)
    8168                            .dwattr $C$DW$732, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8169                            .dwattr $C$DW$732, DW_AT_decl_line(0xfc)
    8170                            .dwattr $C$DW$732, DW_AT_decl_column(0x0b)
    8171                    
    8172                    $C$DW$733       .dwtag  DW_TAG_member
    8173                            .dwattr $C$DW$733, DW_AT_type(*$C$DW$T$6)
    8174                            .dwattr $C$DW$733, DW_AT_name("ClosedFilesCnt")
    8175                            .dwattr $C$DW$733, DW_AT_TI_symbol_name("ClosedFilesCnt")
    8176                            .dwattr $C$DW$733, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8177                            .dwattr $C$DW$733, DW_AT_accessibility(DW_ACCESS_public)
    8178                            .dwattr $C$DW$733, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8179                            .dwattr $C$DW$733, DW_AT_decl_line(0xfd)
    8180                            .dwattr $C$DW$733, DW_AT_decl_column(0x0b)
    8181                    
    8182                    $C$DW$734       .dwtag  DW_TAG_member
    8183                            .dwattr $C$DW$734, DW_AT_type(*$C$DW$T$6)
    8184                            .dwattr $C$DW$734, DW_AT_name("OpenedForWriteCntWithValidFailSafeImage")
    8185                            .dwattr $C$DW$734, DW_AT_TI_symbol_name("OpenedForWriteCntWithValidFailSafeImage")
    8186                            .dwattr $C$DW$734, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    8187                            .dwattr $C$DW$734, DW_AT_accessibility(DW_ACCESS_public)
    8188                            .dwattr $C$DW$734, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8189                            .dwattr $C$DW$734, DW_AT_decl_line(0xfe)
    8190                            .dwattr $C$DW$734, DW_AT_decl_column(0x0b)
    8191                    
    8192                    $C$DW$735       .dwtag  DW_TAG_member
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  150

    8193                            .dwattr $C$DW$735, DW_AT_type(*$C$DW$T$6)
    8194                            .dwattr $C$DW$735, DW_AT_name("OpeneForReadCntWithValidFailSafeImage")
    8195                            .dwattr $C$DW$735, DW_AT_TI_symbol_name("OpeneForReadCntWithValidFailSafeImage")
    8196                            .dwattr $C$DW$735, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8197                            .dwattr $C$DW$735, DW_AT_accessibility(DW_ACCESS_public)
    8198                            .dwattr $C$DW$735, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8199                            .dwattr $C$DW$735, DW_AT_decl_line(0xff)
    8200                            .dwattr $C$DW$735, DW_AT_decl_column(0x0b)
    8201                    
    8202                    $C$DW$736       .dwtag  DW_TAG_member
    8203                            .dwattr $C$DW$736, DW_AT_type(*$C$DW$T$6)
    8204                            .dwattr $C$DW$736, DW_AT_name("ClosedFilesCntWithValidFailSafeImage")
    8205                            .dwattr $C$DW$736, DW_AT_TI_symbol_name("ClosedFilesCntWithValidFailSafeImage")
    8206                            .dwattr $C$DW$736, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    8207                            .dwattr $C$DW$736, DW_AT_accessibility(DW_ACCESS_public)
    8208                            .dwattr $C$DW$736, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8209                            .dwattr $C$DW$736, DW_AT_decl_line(0x100)
    8210                            .dwattr $C$DW$736, DW_AT_decl_column(0x0b)
    8211                    
    8212                    $C$DW$737       .dwtag  DW_TAG_member
    8213                            .dwattr $C$DW$737, DW_AT_type(*$C$DW$T$47)
    8214                            .dwattr $C$DW$737, DW_AT_name("padding")
    8215                            .dwattr $C$DW$737, DW_AT_TI_symbol_name("padding")
    8216                            .dwattr $C$DW$737, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8217                            .dwattr $C$DW$737, DW_AT_accessibility(DW_ACCESS_public)
    8218                            .dwattr $C$DW$737, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8219                            .dwattr $C$DW$737, DW_AT_decl_line(0x101)
    8220                            .dwattr $C$DW$737, DW_AT_decl_column(0x0b)
    8221                    
    8222                            .dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    8223                            .dwattr $C$DW$T$53, DW_AT_decl_line(0xf9)
    8224                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    8225                            .dwendtag $C$DW$T$53
    8226                    
    8227                    $C$DW$T$574     .dwtag  DW_TAG_typedef
    8228                            .dwattr $C$DW$T$574, DW_AT_name("SlFsControlGetCountersResponse_t")
    8229                            .dwattr $C$DW$T$574, DW_AT_type(*$C$DW$T$53)
    8230                            .dwattr $C$DW$T$574, DW_AT_language(DW_LANG_C)
    8231                            .dwattr $C$DW$T$574, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    8232                            .dwattr $C$DW$T$574, DW_AT_decl_line(0x102)
    8233                            .dwattr $C$DW$T$574, DW_AT_decl_column(0x03)
    8234                    
    8235                    
    8236                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    8237                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x0c)
    8238                    $C$DW$738       .dwtag  DW_TAG_member
    8239                            .dwattr $C$DW$738, DW_AT_type(*$C$DW$T$13)
    8240                            .dwattr $C$DW$738, DW_AT_name("FileMaxSize")
    8241                            .dwattr $C$DW$738, DW_AT_TI_symbol_name("FileMaxSize")
    8242                            .dwattr $C$DW$738, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8243                            .dwattr $C$DW$738, DW_AT_accessibility(DW_ACCESS_public)
    8244                            .dwattr $C$DW$738, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8245                            .dwattr $C$DW$738, DW_AT_decl_line(0x111)
    8246                            .dwattr $C$DW$738, DW_AT_decl_column(0x0a)
    8247                    
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  151

    8248                    $C$DW$739       .dwtag  DW_TAG_member
    8249                            .dwattr $C$DW$739, DW_AT_type(*$C$DW$T$13)
    8250                            .dwattr $C$DW$739, DW_AT_name("Properties")
    8251                            .dwattr $C$DW$739, DW_AT_TI_symbol_name("Properties")
    8252                            .dwattr $C$DW$739, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8253                            .dwattr $C$DW$739, DW_AT_accessibility(DW_ACCESS_public)
    8254                            .dwattr $C$DW$739, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8255                            .dwattr $C$DW$739, DW_AT_decl_line(0x112)
    8256                            .dwattr $C$DW$739, DW_AT_decl_column(0x0a)
    8257                    
    8258                    $C$DW$740       .dwtag  DW_TAG_member
    8259                            .dwattr $C$DW$740, DW_AT_type(*$C$DW$T$13)
    8260                            .dwattr $C$DW$740, DW_AT_name("FileAllocatedBlocks")
    8261                            .dwattr $C$DW$740, DW_AT_TI_symbol_name("FileAllocatedBlocks")
    8262                            .dwattr $C$DW$740, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8263                            .dwattr $C$DW$740, DW_AT_accessibility(DW_ACCESS_public)
    8264                            .dwattr $C$DW$740, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8265                            .dwattr $C$DW$740, DW_AT_decl_line(0x113)
    8266                            .dwattr $C$DW$740, DW_AT_decl_column(0x0a)
    8267                    
    8268                            .dwattr $C$DW$T$54, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    8269                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x110)
    8270                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    8271                            .dwendtag $C$DW$T$54
    8272                    
    8273                    $C$DW$T$575     .dwtag  DW_TAG_typedef
    8274                            .dwattr $C$DW$T$575, DW_AT_name("SlFileAttributes_t")
    8275                            .dwattr $C$DW$T$575, DW_AT_type(*$C$DW$T$54)
    8276                            .dwattr $C$DW$T$575, DW_AT_language(DW_LANG_C)
    8277                            .dwattr $C$DW$T$575, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    8278                            .dwattr $C$DW$T$575, DW_AT_decl_line(0x114)
    8279                            .dwattr $C$DW$T$575, DW_AT_decl_column(0x02)
    8280                    
    8281                    
    8282                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    8283                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
    8284                    $C$DW$741       .dwtag  DW_TAG_member
    8285                            .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$13)
    8286                            .dwattr $C$DW$741, DW_AT_name("KeepaliveEnabled")
    8287                            .dwattr $C$DW$741, DW_AT_TI_symbol_name("KeepaliveEnabled")
    8288                            .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8289                            .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8290                            .dwattr $C$DW$741, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8291                            .dwattr $C$DW$741, DW_AT_decl_line(0xfa)
    8292                            .dwattr $C$DW$741, DW_AT_decl_column(0x0a)
    8293                    
    8294                            .dwattr $C$DW$T$55, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    8295                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xf9)
    8296                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    8297                            .dwendtag $C$DW$T$55
    8298                    
    8299                    $C$DW$T$576     .dwtag  DW_TAG_typedef
    8300                            .dwattr $C$DW$T$576, DW_AT_name("SlSockKeepalive_t")
    8301                            .dwattr $C$DW$T$576, DW_AT_type(*$C$DW$T$55)
    8302                            .dwattr $C$DW$T$576, DW_AT_language(DW_LANG_C)
TI ARM Assembler Unix v18.12.2 Sun Jun 23 14:38:59 2019

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  152

    8303                            .dwattr $C$DW$T$576, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    8304                            .dwattr $C$DW$T$576, DW_AT_decl_line(0xfb)
    8305                            .dwattr $C$DW$T$576, DW_AT_decl_column(0x02)
    8306                    
    8307                    
    8308                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    8309                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    8310                    $C$DW$742       .dwtag  DW_TAG_member
    8311                            .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$13)
    8312                            .dwattr $C$DW$742, DW_AT_name("ReuseaddrEnabled")
    8313                            .dwattr $C$DW$742, DW_AT_TI_symbol_name("ReuseaddrEnabled")
    8314                            .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8315                            .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8316                            .dwattr $C$DW$742, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8317                            .dwattr $C$DW$742, DW_AT_decl_line(0xff)
    8318                            .dwattr $C$DW$742, DW_AT_decl_column(0x0a)
    8319                    
    8320                            .dwattr $C$DW$T$56, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    8321                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xfe)
    8322                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    8323                            .dwendtag $C$DW$T$56
    8324                    
    8325                    $C$DW$T$577     .dwtag  DW_TAG_typedef
    8326                            .dwattr $C$DW$T$577, DW_AT_name("SlSockReuseaddr_t")
    8327                            .dwattr $C$DW$T$577, DW_AT_type(*$C$DW$T$56)
    8328                            .dwattr $C$DW$T$577, DW_AT_language(DW_LANG_C)
    8329                            .dwattr $C$DW$T$577, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/n
    8330                            .dwattr $C$DW$T$577, DW_AT_decl_line(0x100)
    8331                            .dwattr $C$DW$T$577, DW_AT_decl_column(0x02)
    8332                    
    8333                    
    8334                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    8335                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x04)
    8336                    $C$DW$743       .dwtag  DW_TAG_member
    8337                            .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$12)
    8338                            .dwattr $C$DW$743, DW_AT_name("RxIpNoBoundaryEnabled")
    8339                            .dwattr $C$DW$743, DW_AT_TI_symbol_name("RxIpNoBoundaryEnabled")
    8340                            .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8341                            .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8342                            .dwattr $C$DW$743, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/net
    8343                            .dwattr $C$DW$743, DW_AT_decl_line(0x104)
    8344                            .dwattr $C$DW$743, DW_AT_decl_column(0x0a)
    8345                    
    8346                            .dwattr $C$DW$T$57, DW_AT_decl_file("/vagrant/Q2_GA_SDK_23062019/sdk_root/source/ti/drivers/ne
    8347                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x103)
    8348                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    8349                            .dwendtag $C$DW$T$57
    8350                    
    8351                    $C$DW$T$578     .dwtag  DW_TAG_typedef
